{
  "database_video_id": 11,
  "youtube_video_id": "rQYMTcppl98",
  "video_title": "Video rQYMTcppl98",
  "video_url": "https://www.youtube.com/watch?v=rQYMTcppl98",
  "summary": "The Yuba County Five, comprising Ted Weiher, Jackie Huett, Bill Sterling, Jack Madruga, and Gary Mathias, vanished on February 24, 1978. All five men had intellectual disabilities or mental health challenges, with Mathias diagnosed with schizophrenia, and they lived with their parents while participating in the Gateway Projects rehabilitation program. On the night of their disappearance, they drove to Chico for a college basketball game in Jack Madruga's 1969 Mercury Montego. They were particularly excited about an upcoming Special Olympics basketball tournament, with a trip to Disneyland as a potential prize.\n\nAfter the game, they stopped at a store for snacks, but instead of returning home, they inexplicably drove into the remote and snow-covered Plumas National Forest. Madruga's car was found abandoned four days later, on February 28, near Rogers Cow Camp, seemingly stuck in deep snow. However, the car was not truly stuck, had a quarter tank of gas, and its engine started easily, raising immediate questions. Inside the vehicle, investigators found wrappers from the snacks they had purchased, but the car keys were missing. Initial search efforts were severely hampered by harsh winter weather, including heavy snow, fog, and freezing temperatures.\n\nA key witness, Joseph Schons, claimed to have seen the five men, along with a woman and child, and a rusty pickup truck near the abandoned car, but his credibility was questioned due to his history of alcoholism and exaggeration. Desperate families also consulted psychics, who offered conflicting and often unhelpful information.\n\nOn June 4, 1978, Ted Weiher's body was discovered in a Forest Service trailer, approximately 32 kilometers from where the car was found. Weiher was severely emaciated and had severe frostbite, indicating he had been alive for weeks, yet the trailer was stocked with plenty of food and heating fuel, baffling investigators. The presence of Gary Mathias's tennis shoes near Weiher's body suggested Mathias had also been in the trailer. The next day, June 5, the bodies of Jack Madruga and Bill Sterling were found about 5 kilometers from the trailer, scattered by animals, with their deaths attributed to hypothermia. On June 6, Jackie Huett's remains were discovered by his father, just 400 meters from the trailer.\n\nThe discovery of the bodies, particularly Weiher's, raised more questions than answers, as it was inexplicable why he would starve with food readily available. Authorities faced criticism for not thoroughly searching the area, including the trailers, earlier in the investigation. Gary Mathias remains the only member of the group whose body was never found, leading to persistent speculation about his fate. The case is plagued by inconsistencies, such as a mysterious gold watch found with Weiher that did not belong to any of the men. The Yuba County Five case remains one of California's most perplexing unsolved mysteries, leaving their families with enduring grief and unanswered questions.",
  "created_at": null
}